<a href="https://colab.research.google.com/github/shukrullo24/Python-darslari/blob/main/Pandas_Kutubxonasi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series ma'lumotlar tuzilmasi

In [ ]:
import pandas as pd
import numpy as np
from pandas import Series

# Lug'atdan series yaratish

In [ ]:
cars_dict = {"malibu": 30000, "Lacetti": 20000, "Matiz": 5000, "Onix": 20000}
type(cars_dict)

dict

In [ ]:
cars_dict

{'malibu': 30000, 'Lacetti': 20000, 'Matiz': 5000, 'Onix': 20000}

In [ ]:
cars1 = Series(cars_dict)
cars1

malibu     30000
Lacetti    20000
Matiz       5000
Onix       20000
dtype: int64

In [ ]:
"tracker" in cars1

False

In [ ]:
 "malibu" in cars1

True

In [ ]:
cars1["Onix"]

np.int64(20000)

In [ ]:
models = ['honda', 'mazda', 'Lacetti', 'malibu', 'Toyota']

In [ ]:
cars2 = Series(cars1, index=models)
cars2

honda          NaN
mazda          NaN
Lacetti    20000.0
malibu     30000.0
Toyota         NaN
dtype: float64

In [ ]:
cars1.isnull()

malibu     False
Lacetti    False
Matiz      False
Onix       False
dtype: bool

In [ ]:
cars2.isnull()

honda       True
mazda       True
Lacetti    False
malibu     False
Toyota      True
dtype: bool

In [ ]:
cars2.name="Avtosalon"

In [ ]:
cars2.index.name = "Modellar", "Narxlar"

In [ ]:
cars2.hasnans

True

In [ ]:
cars2

(Modellar, Narxlar)
honda          NaN
mazda          NaN
Lacetti    20000.0
malibu     30000.0
Toyota         NaN
Name: Avtosalon, dtype: float64